// 定义不同断点下的布局
export const layouts = {
  lg: [ // 4行
    { i: "1", x: 0, y: 0, w: 1, h: 2 },
    { i: "2", x: 1, y: 0, w: 1, h: 1 },
    { i: "3", x: 2, y: 0, w: 1, h: 1 },
    { i: "social", x: 3, y: 0, w: 1, h: 2 },
    { i: "5", x: 1, y: 1, w: 2, h: 2 },
    { i: "6", x: 0, y: 2, w: 1, h: 1 },
    { i: "7", x: 3, y: 2, w: 1, h: 2 },
    { i: "sprite", x: 0, y: 3, w: 2, h: 1 },
    { i: "9", x: 2, y: 3, w: 1, h: 1 },
  ],
  md: [ // 3行
    { i: "1", x: 3, y: 0, w: 1, h: 2 },
    { i: "2", x: 0, y: 2, w: 1, h: 1 },
    { i: "3", x: 1, y: 2, w: 1, h: 1 },
    { i: "social", x: 2, y: 2, w: 1, h: 2 },
    { i: "5", x: 0, y: 0, w: 2, h: 2 },
    { i: "6", x: 0, y: 3, w: 1, h: 2 },
    { i: "7", x: 1, y: 2, w: 1, h: 2 },
    { i: "sprite", x: 0, y: 5, w: 3, h: 1 },
    { i: "9", x: 3, y: 4, w: 1, h: 1 },
  ],
  sm: [ // 2行
    { i: "1", x: 0, y: 2, w: 1, h: 2 },
    { i: "2", x: 0, y: 3, w: 1, h: 1 },
    { i: "3", x: 1, y: 3, w: 1, h: 1 },
    { i: "social", x: 1, y: 2, w: 1, h: 2 },
    { i: "5", x: 0, y: 0, w: 2, h: 2 },
    { i: "6", x: 0, y: 3, w: 1, h: 1 },
    { i: "7", x: 1, y: 3, w: 1, h: 2 },
    { i: "sprite", x: 0, y: 5, w: 2, h: 1 },
    { i: "9", x: 0, y: 4, w: 1, h: 1 },
  ],
  xs: [ // 1行
    { i: "1", x: 0, y: 1, w: 1, h: 1 },
    { i: "2", x: 0, y: 2, w: 1, h: 1 },
    { i: "3", x: 0, y: 3, w: 1, h: 1 },
    { i: "social", x: 0, y: 4, w: 1, h: 2 },
    { i: "5", x: 0, y: 0, w: 1, h: 1 },
    { i: "6", x: 0, y: 6, w: 1, h: 1 },
    { i: "7", x: 0, y: 7, w: 1, h: 1 },
    { i: "sprite", x: 0, y: 8, w: 1, h: 1 },
    { i: "9", x: 0, y: 9, w: 1, h: 1 },
  ],
  xxs: [
    { i: "1", x: 0, y: 1, w: 1, h: 1 },
    { i: "2", x: 0, y: 2, w: 1, h: 1 },
    { i: "3", x: 0, y: 3, w: 1, h: 1 },
    { i: "social", x: 0, y: 4, w: 1, h: 2 },
    { i: "5", x: 0, y: 0, w: 1, h: 1 },
    { i: "6", x: 0, y: 6, w: 1, h: 1 },
    { i: "7", x: 0, y: 7, w: 1, h: 1 },
    { i: "sprite", x: 0, y: 8, w: 1, h: 1 },
    { i: "9", x: 0, y: 9, w: 1, h: 1 },
  ],
};

export const projectLayouts = {
  lg: [
    { i: "manga", x: 0, y: 0, w: 1, h: 1 },
    { i: "sveaflet", x: 1, y: 0, w: 1, h: 1 },
  ],
  md: [
    { i: "manga", x: 0, y: 0, w: 1, h: 1 },
    { i: "sveaflet", x: 1, y: 0, w: 1, h: 1 },
  ],
  sm: [
    { i: "manga", x: 0, y: 0, w: 1, h: 1 },
    { i: "sveaflet", x: 1, y: 0, w: 1, h: 1 },
  ],
  xs: [
    { i: "manga", x: 0, y: 0, w: 1, h: 1 },
    { i: "sveaflet", x: 1, y: 0, w: 1, h: 1 },
  ],
  xxs: [
    { i: "manga", x: 0, y: 0, w: 1, h: 1 },
    { i: "sveaflet", x: 1, y: 0, w: 1, h: 1 },
  ],
};
